trans.addDict([
    [300, 0, "description"], [300, 1, "описание"],
    [301, 0, "first repeat"], [301, 1, "первый повтор"],
    [302, 0, "#"], [302, 1, "№"],
    [303, 0, "step"], [303, 1, "шаг"],
    [304, 0, "count"], [304, 1, "количество"],
    [305, 0, "next"], [305, 1, "следующий"],
    [306, 0, " "], [306, 1, " "],
    [307, 0, "duration"], [307, 1, "продолжительность"],
    [308, 0, "change"], [308, 1, "изменение"],
    [309, 0, "stop"], [309, 1, "завершение"],
    [310, 0, "goal"], [310, 1, "цель"],
    [311, 0, "goal"], [311, 1, "цель"],
    [312, 0, "instant"], [312, 1, "сразу"],
    [313, 0, "even"], [313, 1, "постепенно"],
    [314, 0, "goal"], [314, 1, "цель"],
    [315, 0, "time"], [315, 1, "время"],
]);
//menu
trans.addDict([
    [400, 0, "stepped setter"], [400, 1, "шаговый задатчик"],
    [401, 0, "help"], [401, 1, "помощь"],
    [402, 0, "repeats"], [402, 1, "повторы"],
    [403, 0, "steps"], [403, 1, "шаги"],
    [404, 0, "programs"], [404, 1, "программы"]
]);

//error
trans.addDict([
    [250, 0, "failed to get data from database"], [250, 1, "не удалось получить данные из базы данных"],
    [255, 0, "failed to reset controller programs"], [255, 1, "не удалось перезапустить программы контроллера"],
    [257, 0, "failed to save"], [257, 1, "не удалось сохранить"],
    [256, 0, "failed to get phone from database"], [256, 1, "не удалось получить группы номеров телефона"]
]);




